tutorials/incompressible/simpleFoam/motorBike/0/frontBackUpperPatches
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

upperWall
{
    type slip;
}

frontAndBack
{
    type slip;
}

// ************************************************************************* //
